Revit 2024 API
NavisworksExportOptions.DivideFileIntoLevels Property
 True to divide file into levels, false otherwise. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool DivideFileIntoLevels { get; set; }
Visual Basic
Public Property DivideFileIntoLevels As Boolean
	Get
	Set
Visual C++
public:
property bool DivideFileIntoLevels {
	bool get ();
	void set (bool value);
}
See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace